//ステージデータ
(function() {
	//画像パスの連想配列を用意する
	var imagePath ={
			//研究室背景
			institute:"resources/ui/institute.png"
	}
	//ステージのユニットと背景データ
    window.StageData = [
        {
        	//ステージ1
            startPositions: [
                {type: "enemy02", i: 7, j: 3},
                {type: "enemy03", i: 7, j:4}
            ],
            stageBackground:imagePath.institute
        },
        {
        	//ステージ2
            startPositions: [
                             {type: "enemy01", i: 9, j: 6},
                             {type: "enemy02", i: 8, j: 4},
                             {type: "enemy03", i: 9, j: 4}
            ],
            stageBackground:imagePath.institute
        },
        {
        	//ステージ3
        	startPositions: [
        	                 {type: "enemy01", i: 11, j: 6},
        	                 {type: "enemy02", i: 10, j: 6},
        	                 {type: "enemy04", i: 7, j: 4},
			],
			stageBackground:imagePath.institute
        },
        {
        	//ステージ4
        	startPositions: [
        	                 {type: "enemy01", i: 11, j: 2},
        	                 {type: "enemy02", i: 6, j: 3},
        	                 {type: "enemy03", i: 4, j: 8},
        	                 {type: "enemy04", i: 10, j: 5},
        	                 ],
        	                 stageBackground:imagePath.institute
        },
        {
        	//ステージ5
        	startPositions: [
        	                 {type: "enemy04", i: 8, j: 6},
        	                 {type: "enemy04", i: 7, j: 3},
        	                 {type: "enemy04", i: 9, j: 3},
        	                 {type: "enemy04", i: 10, j: 6},
        	                 ],
        	                 stageBackground:imagePath.institute
        }
    ];
    
    //ステージ間デモのデータ
    window.DemoData = [
                       [
                        {message:"Stage 1",portrait:""},
                        {message:"チーフ:ここが報告にあった研究施設か……",portrait:""},
                        {message:"チーフ:発展途上国には似つかわしい装備の兵士ばかりだな",portrait:""},
                        {message:"チーフ:バックに大きな組織か国がついているのは間違いない",portrait:""},
                        {message:"チーフ:幸い数はたいしたものではない。速やかに制圧するぞ",portrait:""}
                        ],
                        [
                        {message:"Stage 2",portrait:""},
                        {message:"チーフ:敵小隊を発見した。このままいけば先手が取れるな",portrait:""},
                        {message:"チーフ:さっきの奴らは単なる見張りだな。今度は騒ぎを聞きつけて対処しにきた奴らだ",portrait:""},
                        {message:"チーフ:どうやらあのヘルメットをかぶったやつが小隊長のようだな",portrait:""},
                        {message:"チーフ:あいつを倒せばこの小隊は総崩れだ!各員、敵の頭を潰すぞ!",portrait:""},
                        ],
                        [
                         {message:"Stage 3",portrait:""},
                        {message:"チーフ:何だ、あれは!?モンスター!?",portrait:""},
                        {message:"チーフ:こいつら、とんでもないものを作ってやるようだな",portrait:""},
                        {message:"チーフ:あの体つき、飛びかかりでもされたらひとたまりもないな",portrait:""},
                         {message:"チーフ:距離を取って集中砲火を浴びせるぞ!",portrait:""},
                        {message:"チーフ:さあ、化け物退治のはじまりだ!",portrait:""}
                         ],
                       [
                        {message:"Stage 4",portrait:""},
                        {message:"チーフ:数が多いだけでなく、さっきの化け物まで連れてやがる",portrait:""},
                        {message:"チーフ:あまり長居はしたくないところだな",portrait:""},
                        {message:"チーフ:既にこの施設の中心部も近い",portrait:""},
                        {message:"チーフ:相手は手強いが、一気に突破して中心部を爆破するぞ",portrait:""},
                        {message:"チーフ:各員、ここが正念場だ!全力を尽くせ!",portrait:""}
                        ],
                       [
                        {message:"Stage 5",portrait:""},
                        {message:"チーフ:ここが中心部か・・・",portrait:""},
                        {message:"チーフ:あの化け物がうじゃうじゃいやがる。さっさと焼き払っておさらばするか",portrait:""},
                        {message:"チーフ:!? チ、見つかったか。出来はいいようだな",portrait:""},
                        {message:"チーフ:あの脚力が相手では到底逃げられん。速やかに掃討した後、施設を爆破する。",portrait:""},
                        {message:"チーフ:さっさと終わらせて国に帰るぞ!",portrait:""}
                        ]
    ];
    //マップのデータ
    window.MapData = [
                [
                 	//1面
                 	[126,127,128,126,127,128,126,127,128,126,127,128,126],
                 	[4,4,4,4,4,4,4,194,28,4,4,4,4],
                 	[4,4,4,4,4,4,4,4,4,4,4,4,4],
                 	[4,4,4,4,4,4,149,4,4,4,4,4,4],
                 	[4,4,4,4,4,4,89,4,4,4,4,4,4],
                 	[4,4,4,4,4,4,4,4,4,4,4,4,4],
                 	[4,4,4,4,4,4,4,4,4,4,4,4,4],
                 	[4,4,4,4,4,4,4,4,4,4,4,4,4],
                 	[4,4,4,4,4,4,4,4,4,4,4,4,4]
                    ],
                    //2面
                    [
						[126,127,128,126,127,128,126,127,128,126,127,128,126],
						[4,4,4,4,4,4,4,4,72,4,4,224,4],
						[219,220,4,4,4,4,4,4,4,4,4,239,4],
						[234,235,4,4,28,28,28,28,28,4,4,4,4],
						[4,4,4,4,4,4,4,4,4,4,191,4,4],
						[4,4,4,4,28,28,28,28,28,4,206,4,42],
						[4,4,4,4,4,4,4,4,4,4,221,4,4],
						[4,4,4,4,28,28,28,28,28,4,236,4,42],
						[4,4,4,4,4,4,4,4,4,4,4,4,4]
                     ],
                     //3面
                     [
						[126,127,128,126,127,128,126,127,128,126,127,128,126],
						[6,4,4,4,194,4,4,132,4,132,4,132,4],
						[21,4,4,4,4,4,4,147,4,147,4,147,4],
						[36,4,4,4,4,4,4,28,4,28,4,28,4],
						[4,4,4,4,4,4,4,4,4,4,4,4,4],
						[4,4,28,4,28,4,28,4,4,4,4,4,4],
						[4,4,4,4,4,4,4,4,4,4,4,4,4],
						[4,4,28,4,28,4,28,4,4,4,149,189,4],
						[4,4,4,4,4,4,4,4,4,4,4,4,4]
                      ],
                //4面
	                [
						[126,127,128,126,127,128,126,127,128,126,127,128,126],
						[4,4,4,4,4,66,4,4,4,4,4,4,4],
						[4,4,4,4,4,66,4,4,4,66,4,4,4],
						[4,4,4,4,66,4,4,66,4,4,4,4,4],
						[66,4,4,66,4,4,4,4,4,66,4,4,4],
						[4,66,66,4,4,66,4,4,4,4,4,66,66],
						[4,4,4,4,4,4,4,66,4,66,4,66,4],
						[4,4,4,4,4,4,66,4,66,4,66,4,4],
						[4,4,4,4,4,66,4,4,4,4,4,4,4]
	                 ],
	                //5面
	                [
						[126,127,128,126,127,128,126,127,128,126,127,128,126],
						[4,4,4,28,28,28,28,59,4,59,4,59,4],
						[4,4,4,4,4,4,4,74,4,74,4,74,4],
						[4,4,66,4,4,4,4,4,4,4,4,4,4],
						[4,4,4,66,4,4,59,4,59,4,59,4,59],
						[4,4,4,66,4,4,74,4,74,4,74,4,74],
						[4,4,4,4,66,4,4,4,4,4,4,4,4],
						[4,4,4,4,4,66,4,59,4,59,4,59,4],
						[4,4,4,4,4,4,4,74,4,74,4,74,4]
	                 ]
                ];
})();
